yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/spi/src/rtl_common/rtl_spi.c
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "rtl_spi.h"
#include "rtl_rcc.h"

#if SPI0_SUPPORT_MASTER_SLAVE
#define SPI_NOT_SLAVE(SPIx)          (!SPI_IN_SLAVE_MODE(SPIx))
#define SPI_CONFIGURED_MASTER(mode)  (mode == SPI_Mode_Master)
#else
#define SPI_NOT_SLAVE(SPIx)          (SPIx != SPI0_SLAVE)
#define SPI_CONFIGURED_MASTER(mode)  (1)
#endif

#if SPI0_SUPPORT_MASTER_SLAVE
extern void SPI_ConfigMasterSlave(SPIMode_Typedef SPI_Mode);
#endif

#if (SPI_SUPPORT_APH_BRIDGE_FOR_HIGH_SPEED == 1)
extern void SPI_ConfigAPHBridge(SPI_TypeDef *SPIx);
#endif

#if (SPI0_SUPPORT_HS == 1)
extern void SPI_SPI0AHBBridgeConfig(FunctionalState NewState);
#endif

/*============================================================================*
 *                           Public Functions
 *============================================================================*/
/**
  * \brief  Deinitializes the SPIx peripheral registers to their default reset values.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \return None
  */
void SPI_DeInit(SPI_TypeDef *SPIx)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    switch ((uint32_t)SPIx)
    {
#ifdef SPI0
    case (uint32_t)SPI0:
        RCC_PeriphClockCmd(APBPeriph_SPI0, APBPeriph_SPI0_CLOCK, DISABLE);
        break;
#endif
#ifdef SPI0_SLAVE
    case (uint32_t)SPI0_SLAVE:
        RCC_PeriphClockCmd(APBPeriph_SPI0_SLAVE, APBPeriph_SPI0_SLAVE_CLOCK, DISABLE);
        break;
#endif
#ifdef SPI1
    case (uint32_t)SPI1:
        RCC_PeriphClockCmd(APBPeriph_SPI1, APBPeriph_SPI1_CLOCK, DISABLE);
        break;
#endif
#ifdef SPI2
    case (uint32_t)SPI2:
        RCC_PeriphClockCmd(APBPeriph_SPI2, APBPeriph_SPI2_CLOCK, DISABLE);
        break;
#endif
#ifdef SPI3
    case (uint32_t)SPI3:
        RCC_PeriphClockCmd(APBPeriph_SPI3, APBPeriph_SPI3_CLOCK, DISABLE);
        break;
#endif

    default:
        break;
    }
}

/**
  * \brief  Initializes the SPIx peripheral according to the specified
  *         parameters in the SPI_InitStruct.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  SPI_InitStruct: Pointer to a SPI_InitTypeDef structure that
  *         contains the configuration information for the specified SPI peripheral.
  * \return None
  */
void SPI_Init(SPI_TypeDef *SPIx, SPI_InitTypeDef *SPI_InitStruct)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_SPI_DIRECTION_MODE(SPI_InitStruct->SPI_Direction));
    assert_param(IS_SPI_DATASIZE(SPI_InitStruct->SPI_DataSize));
    assert_param(IS_SPI_CPOL(SPI_InitStruct->SPI_CPOL));
    assert_param(IS_SPI_CPHA(SPI_InitStruct->SPI_CPHA));
    assert_param(IS_SPI_FRAME_FORMAT(SPI_InitStruct->SPI_FrameFormat));
    assert_param(IS_SPI_BAUDRATE_PRESCALER(SPI_InitStruct->SPI_BaudRatePrescaler));

    /* Disable SPI device before change configuration */
    SPI_SPIENR_TypeDef spi_0x08 = {.d32 = SPIx->SPI_SPIENR};
    spi_0x08.b.spi_en = 0;
    SPIx->SPI_SPIENR = spi_0x08.d32;

    /* Configure SPI Master mode if select SPI0, SPI1, SPI2 or SPI3 */
    if (IS_SPIM_PERIPH(SPIx))
    {
#if (SPI0_SUPPORT_MASTER_SLAVE == 1)
        if (SPIx == SPI0)
        {
            SPI_ConfigMasterSlave(SPI_InitStruct->SPI_Mode);
        }
#endif

#if (SPI_SUPPORT_APH_BRIDGE_FOR_HIGH_SPEED == 1)
        SPI_ConfigAPHBridge(SPIx);
#endif

#if (SPI0_SUPPORT_HS == 1)
        if (SPIx == SPI0)
        {
            SPI_SPI0AHBBridgeConfig(DISABLE);
        }
        else if (SPIx == SPI0_HS)
        {
            SPI_SPI0AHBBridgeConfig(ENABLE);
        }
#endif
        /* Configure SPI master mode parameters */
        SPI_M_CTRL0_TypeDef spi_0x00 = {.d32 = SPIx->SPI_M_S_CTRL0};
        spi_0x00.b.frf = SPI_InitStruct->SPI_FrameFormat;
        spi_0x00.b.scph = SPI_InitStruct->SPI_CPHA;
        spi_0x00.b.scpol = SPI_InitStruct->SPI_CPOL;
        spi_0x00.b.tmod = SPI_InitStruct->SPI_Direction;
        spi_0x00.b.SPI_DFS_BIT_FIELD = SPI_InitStruct->SPI_DataSize;
        spi_0x00.b.sste = SPI_InitStruct->SPI_ToggleEn;
        SPIx->SPI_M_S_CTRL0 = spi_0x00.d32;
#if (SPI0_SUPPORT_MASTER_SLAVE == 1)
        if (SPI_InitStruct->SPI_Mode == SPI_Mode_Slave)
        {
            SPI_S_CTRL0_TypeDef spi_0x00 = {.d32 = SPIx->SPI_M_S_CTRL0};
            spi_0x00.b.slv_oe = 0;
            spi_0x00.b.dfs = SPI_InitStruct->SPI_DataSize;
            SPIx->SPI_M_S_CTRL0 = spi_0x00.d32;
        }
#endif

        /* Set master clock divider */
        SPI_M_BAUDR_TypeDef spi_0x14 = {.d32 = SPIx->SPI_M_BAUDR};
        spi_0x14.b.sckdv = SPI_InitStruct->SPI_BaudRatePrescaler % 0xFFFF;
        SPIx->SPI_M_BAUDR = spi_0x14.d32;

        /* Enable slave Select function in master mode */
        if (SPI_CONFIGURED_MASTER(SPI_InitStruct->SPI_Mode))
        {
            SPI_M_SER_TypeDef spi_0x10 = {.d32 = SPIx->SPI_M_SER};
            spi_0x10.b.ser = 1;
            SPIx->SPI_M_SER = spi_0x10.d32;
        }

        /* Set read length in SPI EEPROM & rx only mode */
        if ((SPI_InitStruct->SPI_Direction == SPI_Direction_RxOnly) || \
            (SPI_InitStruct->SPI_Direction == SPI_Direction_EEPROM))
        {
            SPI_M_CTRL1_TypeDef spi_0x04 = {.d32 = SPIx->SPI_M_CTRL1};
            if (SPI_InitStruct->SPI_RXNDF > 0)
            {
                spi_0x04.b.ndf = SPI_InitStruct->SPI_RXNDF - 1;
            }
            SPIx->SPI_M_CTRL1 = spi_0x04.d32;
        }
#if (SPI_SUPPORT_WRAP_MODE == 1)
        else if ((SPI_InitStruct->SPI_Direction == SPI_Direction_TxOnly) || \
                 (SPI_InitStruct->SPI_Direction == SPI_Direction_FullDuplex))
        {
            if (SPI_InitStruct->SPI_WrapModeEn)
            {
                SPIx->SPI_WRAP_CTRL = 0;

                /* Wrapper mode enable */
                SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
                SPI_WRAP_TXFTLR_TypeDef spi_0x204 = {.d32 = SPIx->SPI_WRAP_TXFTLR};
                spi_0x200.b.wrap_ctrl_mode = 1;
                if (SPI_InitStruct->SPI_TXNDF > 0)
                {
                    spi_0x200.b.mst_tx_ndf = SPI_InitStruct->SPI_TXNDF - 1;
                }
                spi_0x204.b.tx_fifo_tl = SPI_InitStruct->SPI_TxThresholdLevel;

                SPIx->SPI_WRAP_CTRL = spi_0x200.d32;
                SPIx->SPI_WRAP_TXFTLR = spi_0x204.d32;

                if (SPI_InitStruct->SPI_WrapModeDmaEn)
                {
                    /* enable tx ndf dma */
                    SPI_WRAP_DMACR_TypeDef spi_0x220 = {.d32 = SPIx->SPI_WRAP_DMACR};
                    SPI_WRAP_DMATDLR_TypeDef spi_0x224 = {.d32 = SPIx->SPI_WRAP_DMATDLR};
                    spi_0x220.b.tx_dma_en = 1;
                    spi_0x224.b.dma_tx_dl = SPI_InitStruct->SPI_TxNdfWaterlevel;
                    SPIx->SPI_WRAP_DMACR = spi_0x220.d32;
                    SPIx->SPI_WRAP_DMATDLR = spi_0x224.d32;
                }
            }
        }

        SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
        spi_0x200.b.cs_inv_en = SPI_InitStruct->SPI_CSHighActiveEn;
        SPIx->SPI_WRAP_CTRL = spi_0x200.d32;
#endif
    }
#if !SPI0_SUPPORT_MASTER_SLAVE
    /* Configure SPI Slave mode if select SPI0_SLAVE */
    else if (SPIx == SPI0_SLAVE)
    {
        /* Configure SPI slave mode parameters */
        SPI_S_CTRL0_TypeDef spi_0x00 = {.d32 = SPIx->SPI_M_S_CTRL0};
        spi_0x00.b.scph = SPI_InitStruct->SPI_CPHA;
        spi_0x00.b.scpol = SPI_InitStruct->SPI_CPOL;
        spi_0x00.b.dfs = SPI_InitStruct->SPI_DataSize;
#if (SPI_SUPPORT_SWAP == 1)
        spi_0x00.b.tx_byte_swap = SPI_InitStruct->SPI_SwapTxByteEn;
        spi_0x00.b.tx_bit_swap = SPI_InitStruct->SPI_SwapTxBitEn;
        spi_0x00.b.rx_byte_swap = SPI_InitStruct->SPI_SwapRxByteEn;
        spi_0x00.b.rx_bit_swap = SPI_InitStruct->SPI_SwapRxBitEn;
#endif

        /* Enable slave output */
        spi_0x00.b.slv_oe = 0;
        SPIx->SPI_M_S_CTRL0 = spi_0x00.d32;
    }
#endif
    /* Set Tx empty level */
    SPI_TXFTLR_TypeDef spi_0x18 = {.d32 = SPIx->SPI_TXFTLR};
    spi_0x18.b.tft = SPI_InitStruct->SPI_TxThresholdLevel;
    SPIx->SPI_TXFTLR = spi_0x18.d32;

    /*set Rx full level*/
    SPI_RXFTLR_TypeDef spi_0x1c = {.d32 = SPIx->SPI_RXFTLR};
    spi_0x1c.b.rft = SPI_InitStruct->SPI_RxThresholdLevel;

    /* Config SPI dma mode */
    SPI_DMACR_TypeDef spi_0x4c = {.d32 = SPIx->SPI_DMACR};
    spi_0x4c.b.rdmae = SPI_InitStruct->SPI_RxDmaEn;
    spi_0x4c.b.tdmae = SPI_InitStruct->SPI_TxDmaEn;
    SPIx->SPI_DMACR = spi_0x4c.d32;

