yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/spi/src/rtl_common/rtl_spi.c
    /* Config SPI waterlevel */
    SPI_DMATDLR_TypeDef spi_0x50 = {.d32 = SPIx->SPI_DMATDLR};
    SPI_DMARDLR_TypeDef spi_0x54 = {.d32 = SPIx->SPI_DMARDLR};
    spi_0x50.b.dmatdl = SPI_InitStruct->SPI_TxWaterlevel;
    spi_0x54.b.dmardl = SPI_InitStruct->SPI_RxWaterlevel;
    SPIx->SPI_DMATDLR = spi_0x50.d32;

    if (SPI_InitStruct->SPI_RxDmaEn)
    {
        /* DMA mode should config DMARDLR later if open AHB */
        SPIx->SPI_RXFTLR = spi_0x1c.d32;
        SPIx->SPI_DMARDLR = spi_0x54.d32;
    }
    else
    {
        /* CPU mode should config RXFTLR later if open AHB */
        SPIx->SPI_DMARDLR = spi_0x54.d32;
        SPIx->SPI_RXFTLR = spi_0x1c.d32;
    }

    /* Mask SPI interrupt in REG_DW_SSI_IMR */
    SPIx->SPI_M_S_IMR = 0;
}

/**
  * \brief  Fills each SPI_InitStruct member with its default value.
  * \param  SPI_InitStruct : Pointer to a SPI_InitTypeDef structure which will be initialized.
  * \return None
  */
void SPI_StructInit(SPI_InitTypeDef *SPI_InitStruct)
{
    /* TX and RX Mode */
    SPI_InitStruct->SPI_Direction         = SPI_Direction_FullDuplex;
    /* Number of data to read in RX/EEPROM Mode */
    SPI_InitStruct->SPI_RXNDF              = 1;
    /* 8-bit serial data transfer */
    SPI_InitStruct->SPI_DataSize          = SPI_DataSize_8b;
    /* Inactive state of clock is high */
    SPI_InitStruct->SPI_CPOL              = SPI_CPOL_High;
    /* Serial clock toggles in first of first data bit */
    SPI_InitStruct->SPI_CPHA              = SPI_CPHA_2Edge;
    /* Motorola format */
    SPI_InitStruct->SPI_FrameFormat       = SPI_Frame_Motorola;
    /* Speed = SPI Clock source/ SPI_ClkDIV*/
    SPI_InitStruct->SPI_BaudRatePrescaler = 128;
#if (SPI0_SUPPORT_MASTER_SLAVE == 1)
    SPI_InitStruct->SPI_Mode = SPI_Mode_Master;
#endif
#if (SPI_SUPPORT_SWAP == 1)
    /* Reverse the rx bit or not */
    SPI_InitStruct->SPI_SwapTxBitEn       = DISABLE;
    SPI_InitStruct->SPI_SwapRxBitEn       = DISABLE;
    SPI_InitStruct->SPI_SwapTxByteEn      = DISABLE;
    SPI_InitStruct->SPI_SwapRxByteEn      = DISABLE;
#endif
    /* Toggle CS line or not */
    SPI_InitStruct->SPI_ToggleEn          = DISABLE;
#if (SPI_SUPPORT_WRAP_MODE == 1)
    /* Number of data to read in TX/FullDuplex Mode */
    SPI_InitStruct->SPI_TXNDF             = 1;
    /* Enable CS high active or not */
    SPI_InitStruct->SPI_CSHighActiveEn    = DISABLE;
    /* Disable tx ndf */
    SPI_InitStruct->SPI_WrapModeEn     = DISABLE;
    /* Disable dma */
    SPI_InitStruct->SPI_WrapModeDmaEn  = DISABLE;
    /* SPI Tx waterlevel, should be less than fifo threshold.
       The best value is SPI FIFO Depth - GDMA Msize */
    SPI_InitStruct->SPI_TxNdfWaterlevel   =  SPI_TX_FIFO_SIZE - 1;
#endif
    /* Tx fifo depth: 32/64 bytes */
    SPI_InitStruct->SPI_TxThresholdLevel  = 1;
    /* Rx fifo depth: 32/64 bytes */
    SPI_InitStruct->SPI_RxThresholdLevel  = 0;
    /* Disable dma */
    SPI_InitStruct->SPI_TxDmaEn           = DISABLE;
    SPI_InitStruct->SPI_RxDmaEn           = DISABLE;
    /* SPI Tx waterlevel, should be less than fifo threshold.
       The best value is SPI FIFO Depth - GDMA Msize */
    SPI_InitStruct->SPI_TxWaterlevel      = SPI_TX_FIFO_SIZE - 1;
    /* SPI Rx waterlevel, should be less than fifo threshold.
       The best value is GDMA Msize */
    SPI_InitStruct->SPI_RxWaterlevel      = 1;
}

/**
  * \brief  Enable or disable the specified SPI peripheral.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  NewState: New state of the SPIx peripheral.
  *         This parameter can be: ENABLE or DISABLE.
  * \return None
  */
void SPI_Cmd(SPI_TypeDef *SPIx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    SPI_SPIENR_TypeDef spi_0x08 = {.d32 = SPIx->SPI_SPIENR};
    spi_0x08.b.spi_en = NewState;
    SPIx->SPI_SPIENR = spi_0x08.d32;
}

/**
  * \brief  Transmits a number of bytes through the SPIx peripheral.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  pBuf : Bytes to be transmitted.
  * \param  len : Byte length to be transmitted.
  * \return None
  */
void SPI_SendBuffer(SPI_TypeDef *SPIx, uint8_t *pBuf, uint16_t len)
{
    uint16_t i = 0;

    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

#if (SPI_SUPPORT_WRAP_MODE == 1)
    SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
    if (spi_0x200.b.wrap_ctrl_mode && SPI_NOT_SLAVE(SPIx))
    {
        for (i = 0; i < len; i++)
        {
            /* Read TFNF bit status in SPI_SR register: SET is Tx FIFO is not full */
            while (!(SPIx->SPI_WRAP_SR & SPI_FLAG_TFNF));
            SPIx->SPI_DR[0] = (*pBuf++);
        }
        return;
    }
#endif
    for (i = 0; i < len; i++)
    {
        /* Read TFNF bit status in SPI_SR register: SET is Tx FIFO is not full */
        while (SPI_NOT_SLAVE(SPIx) && !(SPIx->SPI_M_S_SR & SPI_FLAG_TFNF));
        SPIx->SPI_DR[0] = (*pBuf++);
    }
}

/**
  * \brief  Transmits a number of halfwords through the SPIx peripheral.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  pBuf : Halfwords to be transmitted.
  * \param  len: Halfword length to be transmitted.
  * \return None
  */
void SPI_SendHalfWord(SPI_TypeDef *SPIx, uint16_t *pBuf, uint16_t len)
{
    uint16_t i = 0;

    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

#if (SPI_SUPPORT_WRAP_MODE == 1)
    SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
    if (spi_0x200.b.wrap_ctrl_mode && SPI_NOT_SLAVE(SPIx))
    {
        for (i = 0; i < len; i++)
        {
            /* Read TFNF bit status in SPI_SR register: SET is Tx FIFO is not full */
            while (!(SPIx->SPI_WRAP_SR & SPI_FLAG_TFNF));
            SPIx->SPI_DR[0] = (*pBuf++);
        }
        return;
    }
#endif
    for (i = 0; i < len; i++)
    {
        /* Read TFNF bit status in SPI_SR register: SET is Tx FIFO is not full */
        while (SPI_NOT_SLAVE(SPIx) && !(SPIx->SPI_M_S_SR & SPI_FLAG_TFNF));
        SPIx->SPI_DR[0] = (*pBuf++);
    }
}

/**
  * \brief  Transmits a number of words through the SPIx peripheral.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  pBuf : Words to be transmitted.
  * \param  len: Word length to be transmitted.
  * \return None
  */
void SPI_SendWord(SPI_TypeDef *SPIx, uint32_t *pBuf, uint16_t len)
{
    uint16_t i = 0;

    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

#if (SPI_SUPPORT_WRAP_MODE == 1)
    SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
    if (spi_0x200.b.wrap_ctrl_mode && SPI_NOT_SLAVE(SPIx))
    {
        for (i = 0; i < len; i++)
        {
            /* Read TFNF bit status in SPI_SR register: SET is Tx FIFO is not full */
            while (!(SPIx->SPI_WRAP_SR & SPI_FLAG_TFNF));
            SPIx->SPI_DR[0] = (*pBuf++);
        }
        return;
    }
#endif
    for (i = 0; i < len; i++)
    {
        /* Read TFNF bit status in SPI_SR register: SET is Tx FIFO is not full */
        while (SPI_NOT_SLAVE(SPIx) && !(SPIx->SPI_M_S_SR & SPI_FLAG_TFNF));
        SPIx->SPI_DR[0] = (*pBuf++);
    }
}

/**
  * \brief  Clear the specified SPI interrupt.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  SPI_IT: Specifies the SPI interrupt to clear.
  *         This parameter can be one of the following values:
  *         \arg SPI_INT_TXO: Transmit FIFO Overflow Interrupt .
  *         \arg SPI_INT_RXO: Receive FIFO Overflow Interrupt.
  *         \arg SPI_INT_RXU: Receive FIFO Underflow Interrupt.
  *         \arg SPI_INT_MST: Multi-Master Contention Interrupt.
  *         \arg SPI_INT_FAE: TX Frame Alignment Interrupt.
  *         \arg SPI_INT_TUF: Transmit FIFO Underflow Interrupt.
  *         \arg SPI_INT_RIG: Rising edge detect Interrupt.
  *         \arg SPI_INT_WRAP_TXE: TX NDF mode FIFO Transmit FIFO Empty Interrupt.
  *         \arg SPI_INT_WRAP_TXO: TX NDF mode FIFO Overflow Interrupt.
  *         \arg SPI_INT_WRAP_TXD: TX NDF mode transmit done Interrupt.
  * \return None.
  */
void SPI_ClearINTPendingBit(SPI_TypeDef *SPIx, uint16_t SPI_IT)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_SPI_CONFIG_IT(SPI_IT));

    if (SPI_IT & SPI_INT_TXO)
    {
        (void)SPIx->SPI_TXOICR;
    }

    if (SPI_IT & SPI_INT_RXO)
    {
        (void)SPIx->SPI_RXOICR;
    }

