yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/spi/src/rtl_common/rtl_spi.c
    if (SPI_IT & SPI_INT_RXU)
    {
        (void)SPIx->SPI_RXUICR;
    }

    if (SPI_IT & SPI_INT_FAE)
    {
        (void)SPIx->SPI_M_S_MSTICR_FAEICR;
    }

    if (SPI_IT & SPI_INT_TUF)
    {
        (void)SPIx->SPI_M_S_IDR_TXUICR;
    }

    if (SPI_IT & SPI_INT_RIG)
    {
        (void)SPIx->SPI_M_S_VERSION_ID_SSRICR;
    }

#if (SPI_SUPPORT_WRAP_MODE == 1)
    if (SPI_IT & (SPI_INT_WRAP_TXD | SPI_INT_WRAP_TXO))
    {
        (void)SPIx->SPI_WRAP_ICR;
    }
#endif
}

/**
  * \brief  Transmits a data through the SPIx peripheral.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  Data: Data to be transmitted.
  * \return None.
  */
void SPI_SendData(SPI_TypeDef *SPIx, uint32_t Data)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

#if (SPI_SUPPORT_WRAP_MODE == 1)
    SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
    if (spi_0x200.b.wrap_ctrl_mode && SPI_NOT_SLAVE(SPIx))
    {
        while (!(SPIx->SPI_WRAP_SR & SPI_FLAG_TFNF));
        SPIx->SPI_DR[0] = Data;
        return;
    }
#endif
    while (SPI_NOT_SLAVE(SPIx) && !(SPIx->SPI_M_S_SR & SPI_FLAG_TFNF));
    SPIx->SPI_DR[0] = Data;
}

/**
  * \brief  Received data by the SPI peripheral.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \return The most recent received data.
  */
uint32_t SPI_ReceiveData(SPI_TypeDef *SPIx)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    return (uint32_t)SPIx->SPI_DR[0];
}

/**
  * \brief  Get data length in Tx FIFO through the SPIx peripheral.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \return Data length in Tx FIFO.
  */
uint8_t SPI_GetTxFIFOLen(SPI_TypeDef *SPIx)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    SPI_TXFLR_TypeDef spi_0x20 = {.d32 = SPIx->SPI_TXFLR};
    return spi_0x20.b.txtfl;
}

/**
  * \brief  Get data length in Rx FIFO through the SPIx peripheral.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \return Data length in Rx FIFO.
  */
uint8_t SPI_GetRxFIFOLen(SPI_TypeDef *SPIx)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    SPI_RXFLR_TypeDef spi_0x24 = {.d32 = SPIx->SPI_RXFLR};
    return spi_0x24.b.rxtfl;
}

/**
  * \brief  Change SPI direction mode.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  dir: Value of direction mode.
  * \return None.
  */
void SPI_ChangeDirection(SPI_TypeDef *SPIx, uint16_t dir)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_SPI_DIRECTION_MODE(dir));

    /* Disable the selected SPI peripheral */
    SPI_SPIENR_TypeDef spi_0x08 = {.d32 = SPIx->SPI_SPIENR};
    spi_0x08.b.spi_en = 0;
    SPIx->SPI_SPIENR = spi_0x08.d32;

    /* Change SPI direction mode */
    SPI_M_CTRL0_TypeDef spi_0x00 = {.d32 = SPIx->SPI_M_S_CTRL0};
    spi_0x00.b.tmod = dir;
    SPIx->SPI_M_S_CTRL0 = spi_0x00.d32;

    /* Enable the selected SPI peripheral */
    spi_0x08.b.spi_en = 1;
    SPIx->SPI_SPIENR = spi_0x08.d32;
}

/**
  * \brief  Set read Data length only in EEPROM mode through the SPIx peripheral,which
            enables you to receive up to 64 KB of data in a continuous transfer.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  len: Length of read data which can be 1 to 65536.
  * \return None.
  */
void SPI_SetReadLen(SPI_TypeDef *SPIx, uint16_t len)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    /* Disable the selected SPI peripheral */
    SPI_SPIENR_TypeDef spi_0x08 = {.d32 = SPIx->SPI_SPIENR};
    spi_0x08.b.spi_en = 0;
    SPIx->SPI_SPIENR = spi_0x08.d32;

    /* Set read length in SPI EEPROM or RX only mode */
    SPI_M_CTRL1_TypeDef spi_0x04 = {.d32 = SPIx->SPI_M_CTRL1};
    spi_0x04.b.ndf = len - 1;
    SPIx->SPI_M_CTRL1 = spi_0x04.d32;

    /* Enable the selected SPI peripheral */
    spi_0x08.b.spi_en = 1;
    SPIx->SPI_SPIENR = spi_0x08.d32;
}

/**
  * \brief  Set cs number through the SPIx peripheral.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  number: Number can be 0 to 2.
  * \return None.
 */
void SPI_SetCSNumber(SPI_TypeDef *SPIx, uint8_t number)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    /* set cs number */
    SPIx->SPI_M_SER = BIT(number);
}

/**
  * \brief  Check whether the specified SPI interrupt is set.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  SPI_IT: Specifies the SPI interrupt to check.
  *         This parameter can be one of the following values:
  *         \arg SPI_INT_MST: Multi-Master Contention Interrupt.
  *         \arg SPI_INT_FAE: TX Frame Alignment Interrupt.
  *         \arg SPI_INT_RXF: Receive FIFO Full Interrupt.
  *         \arg SPI_INT_RXO: Receive FIFO Overflow Interrupt.
  *         \arg SPI_INT_RXU: Receive FIFO Underflow Interrupt.
  *         \arg SPI_INT_TXO: Transmit FIFO Overflow Interrupt .
  *         \arg SPI_INT_TXE: Transmit FIFO Empty Interrupt.
  *         \arg SPI_INT_WRAP_TXD: TX NDF mode transmit done Interrupt.
  * \return The new state of SPI_IT (SET or RESET).
  */
ITStatus SPI_GetINTStatus(SPI_TypeDef *SPIx, uint32_t SPI_IT)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_SPI_CONFIG_IT(SPI_IT));

    ITStatus bit_status = RESET;

#if (SPI_SUPPORT_WRAP_MODE == 1)
    SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
    if (SPI_IT & (SPI_INT_WRAP_TXE | SPI_INT_WRAP_TXO | SPI_INT_WRAP_TXD))
    {
        if (spi_0x200.b.wrap_ctrl_mode)
        {
            if (SPIx->SPI_WRAP_ISR & (SPI_IT >> 8))
            {
                bit_status = SET;
            }
        }
        return  bit_status;
    }
#endif
    /* Check the status of the specified SPI flag */
    if ((SPIx->SPI_M_S_ISR & SPI_IT) != (uint32_t)RESET)
    {
        bit_status = SET;
    }

    /* Return the SPI_IT status */
    return  bit_status;
}

/**
  * \brief  Enable or disable the specified SPI interrupt source.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  SPI_IT: Specifies the SPI interrupt source to be enabled or disabled.
  *         This parameter can be one of the following values:
  *         \arg SPI_INT_TXE: Transmit FIFO empty interrupt.
  *         \arg SPI_INT_TXO: Transmit FIFO overflow interrupt.
  *         \arg SPI_INT_RXU: Receive FIFO underflow interrupt.
  *         \arg SPI_INT_RXO: Receive FIFO overflow interrupt.
  *         \arg SPI_INT_RXF: Receive FIFO full interrupt.
  *         \arg SPI_INT_MST: Multi-Master Contention Interrupt.
  *         \arg SPI_INT_FAE: TX Frame Alignment interrupt.
  *         \arg SPI_INT_TUF: Transmit FIFO underflow interrupt.
  *         \arg SPI_INT_RIG: Rising edge detect interrupt.
  *         \arg SPI_INT_WRAP_TXD: TX NDF mode transmit done Interrupt.
  * \param  NewState: New state of the specified SPI interrupt source.
  *         This parameter can be: ENABLE or DISABLE.
  * \return None
  */
void SPI_INTConfig(SPI_TypeDef *SPIx, uint16_t SPI_IT, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_SPI_CONFIG_IT(SPI_IT));

#if (SPI_SUPPORT_WRAP_MODE == 1)
    SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
    if (SPI_IT & (SPI_INT_WRAP_TXE | SPI_INT_WRAP_TXO | SPI_INT_WRAP_TXD))
    {
        if (spi_0x200.b.wrap_ctrl_mode)
        {
            if (NewState != DISABLE)
            {
                SPIx->SPI_WRAP_IMR |= (SPI_IT >> 8);
            }
            else
            {
                SPIx->SPI_WRAP_IMR &= ~(SPI_IT >> 8);
            }
        }
    }
#endif
    if (NewState != DISABLE)
    {
        SPIx->SPI_M_S_IMR |= (SPI_IT & 0xff);
    }
    else
    {
        SPIx->SPI_M_S_IMR &= ~(SPI_IT & 0xff);
    }
}


/**
 * \brief  Check whether the specified SPI flag is set.
 *
 * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
 * \param  SPI_FLAG: Specifies the SPI flag to check.
 *         This parameter can be one of the following values:
 *         \arg SPI_FLAG_DCOL: Data Collision Error flag.Set if it is actively transmitting in master mode when another master selects this device as a slave.
 *         \arg SPI_FLAG_TXE: Transmission error flag.Set if the transmit FIFO is empty when a transfer is started in slave mode.
 *         \arg SPI_FLAG_RFF: Receive FIFO full flag. Set if the receive FIFO is completely full.
 *         \arg SPI_FLAG_RFNE: Receive FIFO Not Empty flag.Set if receive FIFO is not empty.
 *         \arg SPI_FLAG_TFE: Transmit FIFO Empty flag.Set if transmit FIFO is empty.
 *         \arg SPI_FLAG_TFNF: Transmit FIFO Not Full flag.Set if transmit FIFO is not full.
 *         \arg SPI_FLAG_BUSY: SPI Busy flag.Set if it is actively transferring data.reset if it is idle or disabled.
 *
 * \return The new state of SPI_FLAG (SET or RESET).
 */
FlagStatus SPI_GetFlagState(SPI_TypeDef *SPIx, uint16_t SPI_FLAG)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_SPI_GET_FLAG(SPI_FLAG));

    FlagStatus bitstatus = RESET;

#if (SPI_SUPPORT_WRAP_MODE == 1)
    SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
    if ((SPI_FLAG & (SPI_FLAG_WRAP_CS_EN | SPI_FLAG_WRAP_TFNF |
                     SPI_FLAG_WRAP_TFE)))
    {
        if ((spi_0x200.b.wrap_ctrl_mode))
        {
            if (SPIx->SPI_WRAP_SR & (SPI_FLAG >> 8))
            {
                bitstatus = SET;
            }
        }
        return  bitstatus;
    }
#endif
    /* Check the status of the specified SPI flag */
    if ((SPIx->SPI_M_S_SR & SPI_FLAG) != (uint8_t)RESET)
    {
        /* SPI_FLAG is set */
        bitstatus = SET;
    }

    /* Return the SPI_FLAG status */
    return  bitstatus;
}

/**
  * \brief  Enable or disable the SPIx GDMA interface.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  SPI_GDMAReq: Specifies the SPI GDMA transfer request to be enabled or disabled.
  *         This parameter can be one of the following values:
  *         \arg SPI_GDMAReq_Tx: Tx buffer DMA transfer request.
  *         \arg SPI_GDMAReq_Rx: Rx buffer DMA transfer request.
  * \param  NewState: New state of the selected SPI GDMA transfer request.
  *         This parameter can be: ENABLE or DISABLE.
  * \return None.
  */
void SPI_GDMACmd(SPI_TypeDef *SPIx, SPIGdmaTransferRequests_TypeDef SPI_GDMAReq,
                 FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_SPI_GDMAREQ(SPI_GDMAReq));

    if (NewState != DISABLE)
    {
        /* Enable the selected SPI GDMA request */
        SPIx->SPI_DMACR |= SPI_GDMAReq;
    }
    else
    {
        /* Disable the selected SPI GDMA request */
        SPIx->SPI_DMACR &= (uint16_t)~(SPI_GDMAReq);
    }
}

/**
  * \brief  Change SPI speed daynamically.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  precalser: Value of prescaler.
  * \return None.
  */
void SPI_ChangeClock(SPI_TypeDef *SPIx, uint32_t prescaler)
{
    /* Disable the selected SPI peripheral */
    SPI_SPIENR_TypeDef spi_0x08 = {.d32 = SPIx->SPI_SPIENR};
    spi_0x08.b.spi_en = 0;
    SPIx->SPI_SPIENR = spi_0x08.d32;

    /* Change SPI speed */
    SPI_M_BAUDR_TypeDef spi_0x14 = {.d32 = SPIx->SPI_M_BAUDR};
    spi_0x14.b.sckdv = prescaler & 0xFFFF;
    SPIx->SPI_M_BAUDR = spi_0x14.d32;

    /* Enable the selected SPI peripheral */
    spi_0x08.b.spi_en = 1;
    SPIx->SPI_SPIENR = spi_0x08.d32;
}

/**
  * \brief  Set SPI Rx sample delay.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  delay: This parameter can be 0 to 255.
  * \return None.
  */
void SPI_SetRxSampleDly(SPI_TypeDef *SPIx, uint32_t delay)
{
    /* Disable the selected SPI peripheral */
    SPI_SPIENR_TypeDef spi_0x08 = {.d32 = SPIx->SPI_SPIENR};
    spi_0x08.b.spi_en = 0;
    SPIx->SPI_SPIENR = spi_0x08.d32;

