yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/spi/src/rtl_common/rtl_spi.c
    /* Set SPI Rx sample delay */
    SPI_M_RSDR_TypeDef spi_0xf0 = {.d32 = SPIx->SPI_M_RSDR};
    spi_0xf0.b.rsd = delay & 0xFF;
    SPIx->SPI_M_RSDR = spi_0xf0.d32;

    /* Enable the selected SPI peripheral */
    spi_0x08.b.spi_en = 1;
    SPIx->SPI_SPIENR = spi_0x08.d32;
}

#if (SPI_SUPPORT_WRAP_MODE == 1)

/**
  * \brief  Enable or disable the specified SPI wrap mode start transfer.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  NewState: new state of the SPIx peripheral.
  *         This parameter can be: ENABLE or DISABLE.
  * \return None
  */
void SPI_WrapModeStartTx(SPI_TypeDef *SPIx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
    spi_0x200.b.mst_tx_fifo_en = NewState;
    SPIx->SPI_WRAP_CTRL = spi_0x200.d32;
}

/**
  * \brief  Whether inverse CS active polarity.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  NewState: new state of the SPIx peripheral.
  *         This parameter can be one of the following values:
  *         \arg  ENABLE: Inverse CS active polarity, which means CS is low active.
  *         \arg  DISABLE: Not inverse CS active polarity, which means CS is high active.
  * \return None
  */
void SPI_InverseCSActivePolarity(SPI_TypeDef *SPIx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
    spi_0x200.b.cs_inv_en = NewState;
    SPIx->SPI_WRAP_CTRL = spi_0x200.d32;
}

/**
  * \brief  Whether drive MOSI low in idle state.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  NewState: new state of the SPIx peripheral.
  *         This parameter can be one of the following values:
  *         \arg  ENABLE: Drive MOSI low in idle state.
  *         \arg  DISABLE: Not drive MOSI low in idle state, which means MOSI is Hi-Z in idle state.
  * \return None
  */
void SPI_DriveMOSILow(SPI_TypeDef *SPIx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
    spi_0x200.b.mosi_drv_low_en = NewState;
    SPIx->SPI_WRAP_CTRL = spi_0x200.d32;
}

/**
  * \brief  Whether enable MOSI pull in idle state.
  * \param  SPIx: Select the SPI peripheral. \ref SPI_Declaration
  * \param  NewState: new state of the SPIx peripheral.
  *         This parameter can be one of the following values:
  *         \arg  ENABLE: MOSI is pull down in idle state.
  *         \arg  DISABLE: MOSI is pull none in idle state.
  * \return  None
  */
void SPI_PullMOSIEn(SPI_TypeDef *SPIx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
    spi_0x200.b.mosi_pull_en = NewState;
    SPIx->SPI_WRAP_CTRL = spi_0x200.d32;
}

#endif

#if (SPI_SUPPORT_RAP_FUNCTION == 1)
void SPI_RAPModeCmd(SPI_TypeDef *SPIx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    SPI_WRAP_CTRL_TypeDef spi_0x200 = {.d32 = SPIx->SPI_WRAP_CTRL};
    spi_0x200.b.rap_ctrl_mode = NewState;
    SPIx->SPI_WRAP_CTRL = spi_0x200.d32;
}

void SPI_SetTaskCmdNum(SPI_TypeDef *SPIx, uint8_t num)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    SPI_WRAP_TCMD_NUM_TypeDef spi_0x230 = {.d32 = SPIx->SPI_WRAP_TCMD_NUM};
    spi_0x230.b.task_cmd_num = num;
    SPIx->SPI_WRAP_TCMD_NUM = spi_0x230.d32;
}

void SPI_SetTaskWaitNum(SPI_TypeDef *SPIx, uint8_t num)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    SPI_WRAP_TWAIT_NUM_TypeDef spi_0x234 = {.d32 = SPIx->SPI_WRAP_TWAIT_NUM};
    spi_0x234.b.task_wait_num = num;
    SPIx->SPI_WRAP_TWAIT_NUM = spi_0x234.d32;
}

void SPI_SetTaskTransferNum(SPI_TypeDef *SPIx, uint8_t num)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    SPI_WRAP_TTRAN_NUM_TypeDef spi_0x238 = {.d32 = SPIx->SPI_WRAP_TTRAN_NUM};
    spi_0x238.b.task_tran_num = num;
    SPIx->SPI_WRAP_TTRAN_NUM = spi_0x238.d32;
}

void SPI_TaskTrigger(SPI_TypeDef *SPIx, uint32_t task)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    SPIx->SPI_WRAP_FW_ST |= BIT(task);
}

bool SPI_TaskEventStsCheck(SPI_TypeDef *SPIx, uint32_t te)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    return SPIx->SPI_WRAP_TASK_STS & BIT(te);
}

void SPI_TaskEventStsClear(SPI_TypeDef *SPIx, uint32_t te)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    SPIx->SPI_WRAP_TASK_STS |= BIT(te);
}
#endif

